3-7/CARAVAN/app/controllers/blogs_controller.rb

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["body", "美味しい料理を作ろう!\r\n追記しました。"], ["updated_at", "2021-08-05 02:39:19.829506"], ["id", 1]]